In [1]:
import pandas as pd 
import numpy as np
from sklearn import linear_model
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder

In [2]:
df = pd.read_csv('e5carprices.csv')
df

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [3]:
le = LabelEncoder()

In [4]:
df['Car Model'] = le.fit_transform(df['Car Model'])
df

    Car Model  Mileage  Sell Price($)  Age(yrs)
0           1    69000          18000         6
1           1    35000          34000         3
2           1    57000          26100         5
3           1    22500          40000         2
4           1    46000          31500         4
5           0    59000          29400         5
6           0    52000          32000         5
7           0    72000          19300         6
8           0    91000          12000         8
9           2    67000          22000         6
10          2    83000          20000         7
11          2    79000          21000         7
12          2    59000          33000         5

In [5]:
x = df[['Mileage', 'Age(yrs)','Car Model']]
x

    Mileage  Age(yrs)  Car Model
0     69000         6          1
1     35000         3          1
2     57000         5          1
3     22500         2          1
4     46000         4          1
5     59000         5          0
6     52000         5          0
7     72000         6          0
8     91000         8          0
9     67000         6          2
10    83000         7          2
11    79000         7          2
12    59000         5          2

In [6]:
y = df['Sell Price($)']
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: Sell Price($), dtype: int64

expriment

In [7]:
reg = linear_model.LinearRegression()

In [8]:
reg.fit(x,y)

LinearRegression()

In [9]:
reg.predict([[59000, 5 ,2]])

array([27823.39163119])

In [10]:
reg.score(x,y)

0.8719970367825953